app/controllers/channels_controller.rb

SELECT `channels`.* FROM `channels`
---
  def index
    @channels = Channel.all