app/controllers/dialogs_controller.rb

SELECT `videos`.* FROM `videos` WHERE `videos`.`id` = 15 LIMIT 1
UPDATE `videos` SET `video_type` = 3, `updated_at` = '2012-08-24 02:21:01' WHERE `videos`.`id` = 15
---
  def modify
    @video = Video.find(params[:id])
    @video.update_attributes(:video_type=>params[:video_type])