app/controllers/splendid_videos_controller.rb

  def index
    channel = params[:forminfo]
    @channels = Channel.all
    if channel != nil
      @forminfo = Video.new
      if channel['cid'] != nil
        @forminfo.cid = channel['cid']
        @channel = channel['cid']
      else
        @forminfo.cid = channel
        @channel = channel
      end
    else
      @channel = @channels[0].cid rescue 0
    end

    @videos = Video.where(:video_type => 3,:cid => @channel).order(:id)
---
SELECT `channels`.* FROM `channels`
SELECT `videos`.* FROM `videos` WHERE `videos`.`video_type` = 3 AND `videos`.`cid` = 100 ORDER BY id