app/controllers/today_videos_controller.rb

  def index

    @videos = Video.where(:video_type => 2).order(:id)
---
SELECT `videos`.* FROM `videos` WHERE `videos`.`video_type` = 2 ORDER BY id